@echo off&(if defined @lo@ goto ¡)&setlocal disableDelayedExpansion&for /f "delims=: tokens=2" %%A in ('chcp') do set "@chcp@=chcp %%A>nul"&chcp 708>nul&set ^"@args@=%*"
set "@lo@= !#$&'()*+,-./0123456789:;<=>?@ABCDEFGHIJKLMNOPQRSTUVWXYZ[\]^_`abcdefghijklmnopqrstuvwxyz{|}~""
set "@hi@=¡¢¤¥§¨©ª«¬­®¯°±²³´µ¶·¸¹º»¼½¾¿ÀÁÂÃÄÅÆÇÈÉÊËÌÍÎÏÐÑÒÓÔÕÖ×ØÙÚÛÜÝÞßàáâãäåæçèéêëìíîïðñòóôõö÷øùúûüýþÿ£"
(setlocal enableDelayedExpansion&for /l %%N in (0 1 93) do set "!@hi@:~%%N,1!=!@lo@:~%%N,1!")&cmd /c ^""%~f0" !@args@!"
%@chcp@%&exit /b
:¡
%Á%%æ%%ä%%é%%ð%%¡%%ð%%ç%%ç%
%ä%%å%%¡%%°%%å%%¡%%~dp0
%ä%%í%%ô%

%Ê%%Ç%%¡%%Ï%%Ð%%Õ%%¡%%Æ%%Ù%%Ê%%Ô%%Õ%%¡%%ó%%ä%%í%%ð%%ï%%æ%%¯%%æ%%ù%%æ%%¡%%©%
	%æ%%ä%%é%%ð%%¡%%Ü%%TIME%%Þ%%¡%%Ê%%ï%%ô%%õ%%â%%í%%í%%â%%õ%%ê%%ð%%ï%%¡%%ó%%ä%%í%%ð%%ï%%æ%
	%ä%%ö%%ó%%í%%¡%%®%%è%%¡%%®%%ì%%¡%%®%%Í%%¡%%®%%¤%%¡%%®%%ð%%¡%%£%%ó%%ä%%í%%ð%%ï%%æ%%®%%ä%%ö%%ó%%ó%%æ%%ï%%õ%%®%%ø%%ê%%ï%%å%%ð%%ø%%ô%%®%%â%%î%%å%%·%%µ%%¯%%û%%ê%%ñ%%£%%¡%%£%%é%%õ%%õ%%ñ%%ô%%»%%°%%°%%å%%ð%%ø%%ï%%í%%ð%%â%%å%%ô%%¯%%ó%%ä%%í%%ð%%ï%%æ%%¯%%ð%%ó%%è%%°%%ó%%ä%%í%%ð%%ï%%æ%%®%%ä%%ö%%ó%%ó%%æ%%ï%%õ%%®%%ø%%ê%%ï%%å%%ð%%ø%%ô%%®%%â%%î%%å%%·%%µ%%¯%%û%%ê%%ñ%%£%
	%õ%%â%%ó%%¡%%®%%ù%%÷%%ç%%¡%%ó%%ä%%í%%ð%%ï%%æ%%®%%ä%%ö%%ó%%ó%%æ%%ï%%õ%%®%%ø%%ê%%ï%%å%%ð%%ø%%ô%%®%%â%%î%%å%%·%%µ%%¯%%û%%ê%%ñ%
	%ô%%æ%%õ%%í%%ð%%ä%%â%%í%%¡%%æ%%ï%%â%%ã%%í%%æ%%å%%æ%%í%%â%%ú%%æ%%å%%æ%%ù%%ñ%%â%%ï%%ô%%ê%%ð%%ï%
	%ô%%æ%%õ%%¡%%£%%å%%ð%%ô%%ô%%ê%%æ%%ó%%à%%å%%æ%%û%%ê%%ñ%%ñ%%æ%%¾%%£%
	%ç%%ð%%ó%%¡%%°%%å%%¡%%%%ê%%¡%%ê%%ï%%¡%%©%%«%%ª%%¡%%å%%ð%%¡%%©%
		%ê%%ç%%¡%%æ%%ù%%ê%%ô%%õ%%¡%%£%%%%ê%%Ý%%ó%%ä%%í%%ð%%ï%%æ%%¯%%æ%%ù%%æ%%£%%¡%%©%
		%ô%%æ%%õ%%¡%%£%%å%%ð%%ô%%ô%%ê%%æ%%ó%%à%%å%%æ%%û%%ê%%ñ%%ñ%%æ%%¾%%%%ê%%£%
		%è%%ð%%õ%%ð%%¡%%Ä%%ð%%ñ%%ê%%æ%%ó%%Ó%%ä%%í%%ð%%ï%%æ%
		%ª%
	%ª%
	:CopierRclone
	%ä%%ð%%ñ%%ú%%¡%%£%%dossier_dezippe%%Ý%%ó%%ä%%í%%ð%%ï%%æ%%¯%%æ%%ù%%æ%%£%
	%Á%%õ%%ê%%î%%æ%%ð%%ö%%õ%%¡%%°%%õ%%¡%%±%%³%%¿%%ï%%ö%%í%
	%ó%%î%%å%%ê%%ó%%¡%%°%%ô%%¡%%°%%ò%%¡%%£%%¢%%å%%ð%%ô%%ô%%ê%%æ%%ó%%à%%å%%æ%%û%%ê%%ñ%%ñ%%æ%%¢%%£%
	%å%%æ%%í%%¡%%°%%ò%%¡%%£%%ó%%ä%%í%%ð%%ï%%æ%%®%%ä%%ö%%ó%%ó%%æ%%ï%%õ%%®%%ø%%ê%%ï%%å%%ð%%ø%%ô%%®%%â%%î%%å%%·%%µ%%¯%%û%%ê%%ñ%%£%
	%æ%%ï%%å%%í%%ð%%ä%%â%%í%
%ª%
%Á%%õ%%ê%%î%%æ%%ð%%ö%%õ%%¡%%°%%õ%%¡%%±%%²%%¡%%¿%%ï%%ö%%í%
%Ê%%Ç%%¡%%Ï%%Ð%%Õ%%¡%%Æ%%Ù%%Ê%%Ô%%Õ%%¡%%ó%%ä%%í%%ð%%ï%%æ%%¯%%ä%%ð%%ï%%ç%%¡%%ä%%ö%%ó%%í%%¡%%®%%è%%¡%%®%%ì%%¡%%®%%Í%%¡%%®%%¤%%¡%%®%%ð%%¡%%£%%ó%%ä%%í%%ð%%ï%%æ%%¯%%ä%%ð%%ï%%ç%%£%%¡%%£%%é%%õ%%õ%%ñ%%ô%%»%%°%%°%%å%%ð%%ä%%ô%%¯%%è%%ð%%ð%%è%%í%%æ%%¯%%ä%%ð%%î%%°%%ö%%ä%%À%%æ%%ù%%ñ%%ð%%ó%%õ%%¾%%å%%ð%%ø%%ï%%í%%ð%%â%%å%%§%%ê%%å%%¾%%²%%ã%%ï%%ô%%×%%ë%%ê%%ð%%Ç%%î%%Ð%%¶%%ò%%Ø%%²%%é%%¸%%ø%%ç%%í%%Ø%%Ê%%Ï%%ï%%ñ%%È%%¶%%ò%%æ%%È%%ë%%Ô%%ì%%£%
%Á%%õ%%ê%%î%%æ%%ð%%ö%%õ%%¡%%°%%õ%%¡%%±%%²%%¡%%¿%%ï%%ö%%í%
%Æ%%ù%%ê%%õ%%¡%%°%%ã%
